obsidian/aaTOP/cool/Postman/Salesforce SOAP api UPdate more than one user at a time.md

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <urn:SessionHeader>
            <urn:sessionId>{{empsesid}}</urn:sessionId>
        </urn:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <urn:update>
     
                 <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0054w00000BJgUGAA1</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0054w00000AR7CGAA1</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0054w00000ARJ02AAH</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0054w00000ARpMoAAL</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0054w00000ASBIUAA5</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0054w00000BH9d9AAD</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0052E00000Ji4o8QAB</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0052E00000Ji3QwQAJ</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0052E00000JiCbtQAF</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
                <urn1:sObjects xsi:type="urn1:User">
                    <urn1:Id>0052E00000Ji4cuQAB</urn1:Id>
                    <IsActive>false</IsActive>
                </urn1:sObjects>
        </urn:update>
    </soapenv:Body>
</soapenv:Envelope>
